# 전공 학점
ans = 0

# 2016-동계
ans += 3 * 3.5  # 회계원리
# 2017-1
ans += 3 * 3    # 국제경영학
ans += 3 * 3.5  # 재무관리원론
ans += 3 * 3    # 인적자원관리
# 2017-2
ans += 3 * 2.5  # 마케팅원론
ans += 3 * 2.5  # 조직행동론
ans += 3 * 4    # 중국시장환경론
# 2018-1
ans += 3 * 3    # 데이터분석
# 2018-2
ans += 3 * 2.5  # 서비스마케팅
ans += 3 * 3.5  # 노사관계론
ans += 3 * 3.5  # 국제협상전략
ans += 3 * 3.5  # WTO연구
# 2018-동계
ans += 3 * 3.5  # ERP개론
# 2019-1
ans += 3 * 4    # 앙트레프레너십
ans += 3 * 2.5  # 국제무역론
ans += 3 * 4    # 신흥시장연구
ans += 3 * 3    # 미국경제론
# 2019-동계
ans += 3 * 4    # 국제통상원론
# 2021-1
ans += 3 * 4    # 국제마케팅
ans += 3 * 4    # 글로벌경영전략
ans += 3 * 4.5  # 재무회계
ans += 3 * 4    # 운영관리
# 2021-하계
ans += 3 * 4.5  # 경영정보
ans += 3 * 4.5  # 컴퓨터프로그래밍

print(round(ans/72, 2))
